/*
                                                 " وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا "

╔░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░╗
║                                                                                                                               ║
║ ██╗  ██╗ ██╗  ██╗  █████╗  ██╗      ███████╗ ██████╗           ██████╗   █████╗  ██████╗  ███████╗ ███████╗ ███████╗ ██████╗  ║
║ ██║ ██╔╝ ██║  ██║ ██╔══██╗ ██║      ██╔════╝ ██╔══██╗         ██╔════╝  ██╔══██╗ ╚════██  ██╔════╝ ██╔════╝ ██╔════╝ ██╔══██╗ ║
║ █████╔╝  ███████║ ███████║ ██║      █████╗   ██║  ██║         ╚█████╗   ███████║ ██████╝  █████╗   █████╗   █████╗   ██║  ██║ ║
║ ██╔═██╗  ██╔══██║ ██╔══██║ ██║      ██╔══╝   ██║  ██║           ╚═══██╗ ██╔══██║ ╚════██╗ ██╔══╝   ██╔══╝   ██╔══╝   ██║  ██║ ║
║ ██║  ██╗ ██║  ██║ ██║  ██║ ███████╗ ███████╗ ██████╔╝          ██████╔╝ ██║  ██║ ██████╔╝ ███████╗ ███████╗ ███████╗ ██████╔╝ ║
║ ╚═╝  ╚═╝ ╚═╝  ╚═╝ ╚═╝  ╚═╝ ╚══════╝ ╚══════╝ ╚═════╝  ███████╗ ╚═════╝  ╚═╝  ╚═╝ ╚═════╝  ╚══════╝ ╚══════╝ ╚══════╝ ╚═════╝  ║
║                                                       ╚══════╝                                                                ║
╚░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░ The king gets sick and doesn't die ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░╝
*/
#include <bits/stdc++.h>
#include <unordered_map>
using namespace std;
#define ll long long
#define int long long
#define endl '\n'
#define all(v) v.begin(), v.end()
#define rall(v) v.rbegin(), v.rend()
#define Max(a) *max_element(all(a))
#define Min(a) *min_element(all(a))
#define khaled_sa3eeed ios_base::sync_with_stdio(0);cin.tie(0);cout.tie(0);
void solve()
{
    ll q = 9;
    while (q--)
    {
        string s; cin >> s;
        for (auto& ch : s)
        {
            if (ch == '8') { ch = '9'; }
        }
        cout << s << endl;
    }
}
int32_t main()
{
    khaled_sa3eeed;
    ll TestCases; cin >> TestCases; while (TestCases--)
    {
        solve();
        cout << endl;
    }
    return (0 * 0);
}